@ggtisc We've seen 2 issues so far (one of them is with STATE and another one with config for the instance), but the one that concerns me a bit more is the one where Terraform isn't able to compare the details from the API.  

<small><details><summary>API Response during state refresh:</summary>

```
{
  "createTime": "2025-10-01T17:18:54.285425Z",
  "dataPersistentDiskSpec": {
    "diskSizeGb": "100",
    "diskType": "pd-standard"
  },
  "description": "ML-optimized Colab Enterprise runtime instance with balanced resources",
  "displayName": "test-jigar",
  "eucConfig": {},
  "expirationTime": "2026-03-30T17:19:39.818216Z",
  "healthState": "HEALTHY",
  "idleShutdownConfig": {
    "idleTimeout": "7200s"
  },
  "labels": {
    "aiplatform.googleapis.com/colab_enterprise_pool": "false",
    "aiplatform.googleapis.com/notebook_runtime_gce_instance_id": "REDACTED"
  },
  "machineSpec": {
    "machineType": "n1-standard-8"
  },
  "name": "REDACTED",
  "networkSpec": {
    "enableInternetAccess": true,
    "network": "REDACTED",
    "subnetwork": "REDACTED"
  },
  "notebookRuntimeTemplateRef": {
    "notebookRuntimeTemplate": "projects/PROJECT_NUMBER/locations/us-east1/notebookRuntimeTemplates/665644339455590400"
  },
  "notebookRuntimeType": "USER_DEFINED",
  "proxyUri": "rapitzjoqeeps-dot-us-east1.aiplatform-notebook.googleusercontent.com",
  "reservationAffinity": {
    "consumeReservationType": "RESERVATION_NONE"
  },
  "runtimeState": "RUNNING",
  "runtimeUser": "jigar.patel@pager.com",
  "satisfiesPzi": true,
  "softwareConfig": {
    "colabImage": {
      "description": "Python 3.11",
      "releaseName": "py311"
    }
  },
  "updateTime": "2025-10-01T17:19:39.749828Z",
  "version": "colab-on-gcp-20250924-2000-rc0-cos"
}
```
</details></small>


<small><details><summary>Terraform shows the following pending changes (`description`, `display_name` and `runtime_user` might be falsely shown as forcing the replacement) :</summary>

```
  # module.colab_enterprise.google_colab_runtime.runtimes["test-jigar"] must be replaced
-/+ resource "google_colab_runtime" "runtimes" {
      + description           = "ML-optimized Colab Enterprise runtime instance with balanced resources" # forces replacement
      + display_name          = "test-jigar" # forces replacement
      + expiration_time       = (known after apply)
      ~ id                    = "projects/REDACTED/locations/us-east1/notebookRuntimes/" -> (known after apply)
      ~ is_upgradable         = false -> (known after apply)
      + notebook_runtime_type = (known after apply)
      + runtime_user          = "jigar.patel@pager.com" # forces replacement
      + state                 = (known after apply)
        # (4 unchanged attributes hidden)

      + notebook_runtime_template_ref {
          + notebook_runtime_template = "projects/PROJECT_ID/locations/us-east1/notebookRuntimeTemplates/665644339455590400" # forces replacement
        }
    }
```
</details></small>

<small><details><summary>This is the API payload that gets sent to GCP when applying:</summary>
```
{
 "notebookRuntime": {
  "description": "ML-optimized Colab Enterprise runtime instance with balanced resources",
  "displayName": "test-jigar",
  "runtimeUser": "jigar.patel@pager.com"
 },
 "notebookRuntimeTemplate": "projects/PROJECT_ID/locations/us-east1/notebookRuntimeTemplates/665644339455590400"
}
```
</details></small>

I think the issue might be with the ref of notebook_runtime_template.  GCP's API returns a PROJECT_NUMBER and our code references `notebook_runtime_template = google_colab_runtime_template.templates[each.value.template].id` and that is the only attribute we can define in our config.  

PS: I work with Lance. 


The only thing i can think of right now is to replace the PROJECT_NUMBER with PROJECT_ID using `replace()`